openfoam/test_cases/CB4_steady_ref_0/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            ptInletVelocity;
        direction       (0 -1 0);
        model           "rise_vel_CB4.ts";
    }
    outlet
    {
        type            zeroGradient;
    }
    side
    {
        type            slip;
    }
    bubble
    {
	type            slip;
    }
    "wedge_.*"
    {
        type            wedge;
    }

}


// ************************************************************************* //
